&НаКлиенте
Процедура ВыполнитьОбработку(Команда)

	ИмяСервераSQL = "DESKTOP-TA7MEHD";
    ПользовательSQL = "sa";
    ПарольSQL = "123";
    БазаДанныхSQL = "1C_DEMO";
    ТаблицаSQL = "Table_1";

	Попытка
        Соединение  = Новый COMОбъект("ADODB.Connection");
        Команда     = Новый COMОбъект("ADODB.Command");
        Выборка     = Новый COMОбъект("ADODB.RecordSet");
		Соединение.ConnectionString = 	"driver={SQL Server};" +
			"server="+ИмяСервераSQL+";"+
			"uid="+ПользовательSQL+";"+
			"pwd="+ПарольSQL+";"+
			"database="+БазаДанныхSQL+";";
        Соединение.ConnectionTimeout = 30;
        Соединение.CommandTimeout = 600;
        //Открытие соединение
        Соединение.Open();
        Команда.ActiveConnection   = Соединение;

    Исключение
        Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки; 
	
	Для Каждого Стр Из Данные Цикл
		ТекстСтроки =
	        "INSERT INTO [dbo].["+ ТаблицаSQL +"] ([name],[last_name])
	        |VALUES ('"+ Стр.Имя +"', '"+ Стр.Фамилия +"')";
	    Попытка
	        Соединение.Execute(ТекстСтроки,,128);
	    Исключение
	        Сообщить(ОписаниеОшибки());
	    КонецПопытки;
	
	КонецЦикла;

КонецПроцедуры 
